Examinator/src/Catalogs/ОтборыПользователейСУО/ОтборыПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОтборыПользователейСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КритерийВключения</name>
    <type>
      <types>EnumRef.ВариантыПримененияУсловийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обучение</name>
    <attributes>
      <name>СценарийОбучения</name>
      <type>
        <types>CatalogRef.ВидыМероприятийСУО</types>
        <types>CatalogRef.КаталогМероприятийСУО</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОбученияОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОбученияДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогрессОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогрессДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ВариантыПримененияУсловийСУО/ВариантыПримененияУсловийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПримененияУсловийСУО</name>
  <enumValues>
    <name>ИЛИ</name>
  </enumValues>
  <enumValues>
    <name>И</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/УчебныеГруппыСУО/УчебныеГруппыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ОтборыПользователейСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПользовательВходитВОтбор(ПравилоОтбора, Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПравилоОтбора) Тогда
		Возврат Истина; // Если нет отбора, то пропускаем пользователя
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если ПравилоОтбора.ЭтоГруппа Тогда
		
		Если ПравилоОтбора.КритерийВключения = Перечисления.ВариантыПримененияУсловийСУО.И Тогда		
			ПравилоВыполнено = Истина; // Если будет хотя бы одно Ложь, то ставим Ложь вместо Истина		
		Иначе		
			ПравилоВыполнено = Ложь; // Если будет хотя бы одна Истина, то поставим Истина		
		КонецЕсли;
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтборыПользователейСУО.Ссылка
			|ИЗ
			|	Справочник.ОтборыПользователейСУО КАК ОтборыПользователейСУО
			|ГДЕ
			|	ОтборыПользователейСУО.Родитель = &Родитель
			|	И ОтборыПользователейСУО.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Родитель", ПравилоОтбора);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ПодчиненноеПравилоВыполнено = ПользовательВходитВОтбор(ВыборкаДетальныеЗаписи.Ссылка, Пользователь); // Рекурсия
			
			Если ПравилоОтбора.КритерийВключения = Перечисления.ВариантыПримененияУсловийСУО.И Тогда
				Если НЕ ПодчиненноеПравилоВыполнено Тогда
					ПравилоВыполнено = Ложь;
					Прервать
				КонецЕсли;
			Иначе
				Если ПодчиненноеПравилоВыполнено Тогда
					ПравилоВыполнено = Истина;
					Прервать
				КонецЕсли;				
			КонецЕсли;			
			
		КонецЦикла;
		
	Иначе
		
		ПравилоВыполнено = Истина; // Правило выполнено, если нет ни одного неверного условия
		
		// Проверяем все ТЧ, кроме обучения
		
		МассивПроверок = Новый Массив;
		
		Если ПравилоОтбора.УчебныеГруппы.Количество() > 0 Тогда
			МассивПроверок.Добавить("УчебныеГруппы");
		КонецЕсли;
		
		Если ПравилоОтбора.Должности.Количество() > 0 Тогда
			МассивПроверок.Добавить("Должности");
		КонецЕсли;
		
		Если ПравилоОтбора.Организации.Количество() > 0 Тогда
			МассивПроверок.Добавить("Организации");
		КонецЕсли;
		
		Если ПравилоОтбора.ПодразделенияПредприятия.Количество() > 0 Тогда
			МассивПроверок.Добавить("ПодразделенияПредприятия");
		КонецЕсли;
		
		Если ПравилоОтбора.Обучение.Количество() > 0 Тогда
			МассивПроверок.Добавить("Обучение");
		КонецЕсли;
		
		Для каждого Проверка Из МассивПроверок Цикл
			
			// Ищем хотя бы одно неверное условие и сразу останавливаем поиск.
			
			Если Проверка = "УчебныеГруппы" И ПравилоВыполнено Тогда
				
				Для каждого Строка Из ПравилоОтбора.УчебныеГруппы Цикл				
	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	УчебныеГруппыСУОСостав.Пользователь
						|ИЗ
						|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
						|ГДЕ
						|	УчебныеГруппыСУОСостав.Ссылка = &УчебнаяГруппа
						|	И УчебныеГруппыСУОСостав.Пользователь = &Пользователь";
					
					Запрос.УстановитьПараметр("Пользователь", Пользователь);
					Запрос.УстановитьПараметр("УчебнаяГруппа", Строка.УчебнаяГруппа);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда
						ПравилоВыполнено = Ложь;
						Прервать;
					КонецЕсли;
				
				КонецЦикла;				
				
			КонецЕсли;
			
			
			Если Проверка = "Организации" И ПравилоВыполнено Тогда
				
				Для каждого Строка Из ПравилоОтбора.Организации Цикл
	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	СотрудникиСУОСрезПоследних.Пользователь
						|ИЗ
						|	РегистрСведений.СотрудникиСУО.СрезПоследних(
						|			,
						|			Уволен = ЛОЖЬ
						|				И Организация = &Организация
						|				И Пользователь = &Пользователь) КАК СотрудникиСУОСрезПоследних";
					
					Запрос.УстановитьПараметр("Организация", Строка.Организация);
					Запрос.УстановитьПараметр("Пользователь", Пользователь);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда
						ПравилоВыполнено = Ложь;
						Прервать;
					КонецЕсли;
			
				КонецЦикла;
			
				
			КонецЕсли;
			
			
			Если Проверка = "Должности" И ПравилоВыполнено Тогда
				
				Для каждого Строка Из ПравилоОтбора.Должности Цикл
	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	СотрудникиСУОСрезПоследних.Пользователь
						|ИЗ
						|	РегистрСведений.СотрудникиСУО.СрезПоследних(
						|			,
						|			Уволен = ЛОЖЬ
						|				И Должность = &Должность
						|				И Пользователь = &Пользователь) КАК СотрудникиСУОСрезПоследних";
					
					Запрос.УстановитьПараметр("Должность", Строка.Должность);
					Запрос.УстановитьПараметр("Пользователь", Пользователь);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда
						ПравилоВыполнено = Ложь;
						Прервать;
					КонецЕсли;
			
				КонецЦикла;				
				
			КонецЕсли;
			
			
			Если Проверка = "ПодразделенияПредприятия" И ПравилоВыполнено Тогда
				
				Для каждого Строка Из ПравилоОтбора.ПодразделенияПредприятия Цикл
	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	СотрудникиСУОСрезПоследних.Пользователь
						|ИЗ
						|	РегистрСведений.СотрудникиСУО.СрезПоследних(
						|			,
						|			Уволен = ЛОЖЬ
						|				И ПодразделениеПредприятия = &ПодразделениеПредприятия
						|				И Пользователь = &Пользователь) КАК СотрудникиСУОСрезПоследних";
					
					Запрос.УстановитьПараметр("ПодразделениеПредприятия", Строка.ПодразделениеПредприятия);
					Запрос.УстановитьПараметр("Пользователь", Пользователь);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда
						ПравилоВыполнено = Ложь;
						Прервать;
					КонецЕсли;
			
				КонецЦикла;							
				
			КонецЕсли;
			
			
			Если Проверка = "Обучение" И ПравилоВыполнено Тогда
				
				Для каждого Строка Из ПравилоОтбора.Обучение Цикл
					
					ДиапазонБаллов = Новый Структура("От, До", Строка.НачалоДиапазонаБаллов, Строка.КонецДиапазонаБаллов);
					ДлительностьСтруктура = Новый Структура("От, До", Строка.ДлительностьОбученияОт, Строка.ДлительностьОбученияДо);
					ПрогрессСтруктура = Новый Структура("От, До", Строка.ПрогрессОт, Строка.ПрогрессДо);
				
					// Если в правиле указано проведение обучение, то смотрим по нему,
					// независимо от того, является оно сценарием или нет.
				
					Если ТипЗнч(Строка.СценарийОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
						
						Если НЕ Документы.ПроведениеОбученияСУО.ЕстьУчастникОбучения(Строка.СценарийОбучения ,Пользователь,, Строка.Статус, ДиапазонБаллов, ДлительностьСтруктура, ПрогрессСтруктура) Тогда
							ПравилоВыполнено = Ложь;
							Прервать;							
						КонецЕсли;								
						
					ИначеЕсли ТипЗнч(Строка.СценарийОбучения) = Тип("СправочникСсылка.ВидыМероприятийСУО") Тогда
						
						Если НЕ Документы.ПроведениеОбученияСУО.ЕстьУчастникОбучения(,Пользователь,, Строка.Статус, ДиапазонБаллов, ДлительностьСтруктура, ПрогрессСтруктура, Строка.СценарийОбучения) Тогда
							ПравилоВыполнено = Ложь;
							Прервать;
						КонецЕсли;										
						
					Иначе
						
						Если НЕ Документы.ПроведениеОбученияСУО.ЕстьУчастникОбучения(,Пользователь, Строка.СценарийОбучения, Строка.Статус, ДиапазонБаллов, ДлительностьСтруктура, ПрогрессСтруктура) Тогда
							ПравилоВыполнено = Ложь;
							Прервать;
						КонецЕсли;				
						
					КонецЕсли;
					
					
				КонецЦикла;				
				
			КонецЕсли;
			
			Если НЕ ПравилоВыполнено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПравилоВыполнено;
	
КонецФункции

Процедура ПользователиОтбора(ПравилоОтбора, МассивПользователей) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если МассивПользователей = Неопределено Тогда
		МассивПользователей = Новый Массив;
	КонецЕсли;	
	
	// Получаем переменные
	
	ТаблицаПользователей = Новый ТаблицаЗначений;
	ТаблицаПользователей.Колонки.Добавить("Пользователь");
	ТаблицаПользователей.Колонки.Добавить("КоличествоПравил", Новый ОписаниеТипов("Число"));
	
	КоличествоПравил = 0;	
	
	Если НЕ ПравилоОтбора.ЭтоГруппа Тогда
		
		Если ПравилоОтбора.УчебныеГруппы.Количество() > 0 Тогда			
			
			КоличествоПравил = КоличествоПравил + ПравилоОтбора.УчебныеГруппы.Количество();
			
			УчебныеГруппы = ПравилоОтбора.УчебныеГруппы.ВыгрузитьКолонку("УчебнаяГруппа");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	УчебныеГруппыСУОСостав.Пользователь КАК Пользователь
				|ИЗ
				|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
				|ГДЕ
				|	УчебныеГруппыСУОСостав.Ссылка В(&УчебныеГруппы)";
			
			Запрос.УстановитьПараметр("УчебныеГруппы", УчебныеГруппы);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				
				ДобавитьПользователяВТаблицу(ТаблицаПользователей, ВыборкаДетальныеЗаписи.Пользователь);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПравилоОтбора.Должности.Количество() > 0 Тогда
			
			КоличествоПравил = КоличествоПравил + ПравилоОтбора.Должности.Количество();
			
			Должности = ПравилоОтбора.Должности.ВыгрузитьКолонку("Должность");
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.СотрудникиСУО.СрезПоследних(
				|			,
				|			Уволен = ЛОЖЬ
				|				И Должность В (&Должности)) КАК СотрудникиСУОСрезПоследних";
			
			Запрос.УстановитьПараметр("Должности", Должности);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ДобавитьПользователяВТаблицу(ТаблицаПользователей, ВыборкаДетальныеЗаписи.Пользователь);
				
			КонецЦикла;							
			
		КонецЕсли;		
		
		Если ПравилоОтбора.Организации.Количество() > 0 Тогда
			
			КоличествоПравил = КоличествоПравил + ПравилоОтбора.Организации.Количество();
			
			Организации = ПравилоОтбора.Организации.ВыгрузитьКолонку("Организация");
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.СотрудникиСУО.СрезПоследних(
				|			,
				|			Уволен = ЛОЖЬ
				|				И Организация В (&Организации)) КАК СотрудникиСУОСрезПоследних";
			
			Запрос.УстановитьПараметр("Организации", Организации);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ДобавитьПользователяВТаблицу(ТаблицаПользователей, ВыборкаДетальныеЗаписи.Пользователь);
				
			КонецЦикла;			
			
		КонецЕсли;
		
		Если ПравилоОтбора.ПодразделенияПредприятия.Количество() > 0 Тогда
			
			КоличествоПравил = КоличествоПравил + ПравилоОтбора.ПодразделенияПредприятия.Количество();
			
			ПодразделенияПредприятия = ПравилоОтбора.ПодразделенияПредприятия.ВыгрузитьКолонку("ПодразделениеПредприятия");
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.СотрудникиСУО.СрезПоследних(
				|			,
				|			Уволен = ЛОЖЬ
				|				И ПодразделениеПредприятия В (&ПодразделенияПредприятия)) КАК СотрудникиСУОСрезПоследних";
			
			Запрос.УстановитьПараметр("ПодразделенияПредприятия", ПодразделенияПредприятия);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ДобавитьПользователяВТаблицу(ТаблицаПользователей, ВыборкаДетальныеЗаписи.Пользователь);
				
			КонецЦикла;					
			
		КонецЕсли;
		
		Если ПравилоОтбора.Обучение.Количество() > 0 Тогда
			
			Для каждого Строка Из ПравилоОтбора.Обучение Цикл
				
				КоличествоПравил = КоличествоПравил + 1;
				
				ДиапазонБаллов = Новый Структура("От, До", Строка.НачалоДиапазонаБаллов, Строка.КонецДиапазонаБаллов);
				ДлительностьСтруктура = Новый Структура("От, До", Строка.ДлительностьОбученияОт, Строка.ДлительностьОбученияДо);
				ПрогрессСтруктура = Новый Структура("От, До", Строка.ПрогрессОт, Строка.ПрогрессДо);
			
				// Если в правиле указано проведение обучение, то смотрим по нему,
				// независимо от того, является оно сценарием или нет.
			
				Если ТипЗнч(Строка.СценарийОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
					
					ТаблицаУчастников = Документы.ПроведениеОбученияСУО.УчастникиОбучения(Строка.СценарийОбучения, Ложь, ДиапазонБаллов,,Строка.Статус, ДлительностьСтруктура, ПрогрессСтруктура);
					
				ИначеЕсли ТипЗнч(Строка.СценарийОбучения) = Тип("СправочникСсылка.ВидыМероприятийСУО") Тогда
					
					ТаблицаУчастников = Документы.ПроведениеОбученияСУО.УчастникиОбучения(, Ложь, ДиапазонБаллов,,Строка.Статус, ДлительностьСтруктура, ПрогрессСтруктура, Строка.СценарийОбучения);
					
				Иначе
					
					ТаблицаУчастников = Документы.ПроведениеОбученияСУО.УчастникиОбучения(, Ложь, ДиапазонБаллов, Строка.СценарийОбучения,Строка.Статус, ДлительностьСтруктура, ПрогрессСтруктура);
					
				КонецЕсли;
				
				Если ТаблицаУчастников <> Неопределено Тогда
					
					 Для каждого Строка Из ТаблицаУчастников Цикл
					 
					 	ДобавитьПользователяВТаблицу(ТаблицаПользователей, Строка.Пользователь);					 	
					 
					 КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;						
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	// Завершаем
	
	Для каждого Строка Из ТаблицаПользователей Цикл
	
		Если Строка.КоличествоПравил >= КоличествоПравил
			И МассивПользователей.Найти(Строка.Пользователь) = Неопределено Тогда
			
			МассивПользователей.Добавить(Строка.Пользователь);
			
		КонецЕсли;
	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ДобавитьПользователяВТаблицу(ТаблицаПользователей, Пользователь)
	
	СтрокаТаблицы = ТаблицаПользователей.Найти(Пользователь, "Пользователь");
	
	Если СтрокаТаблицы = Неопределено Тогда
		
		СтрокаТаблицы = ТаблицаПользователей.Добавить();
		СтрокаТаблицы.Пользователь = Пользователь;
		
	КонецЕсли;	
		
	СтрокаТаблицы.КоличествоПравил = СтрокаТаблицы.КоличествоПравил + 1;
	
КонецПроцедуры

Функция ВсеОтборы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтборыПользователейСУО.Ссылка
		|ИЗ
		|	Справочник.ОтборыПользователейСУО КАК ОтборыПользователейСУО
		|ГДЕ
		|	ОтборыПользователейСУО.ПометкаУдаления = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецЕсли
